In [265]:
# This is Homework 04a (Pandas - Part 1) 
# of the "Data Science" class at Technische Hochschule Rosenheim

## Data Manipulation with Pandas

### Exercises

#### Starting Up

- import NumPy and Pandas in the usual way and print the Pandas Version
- in addition, import the Series and DataFrame classes from Pandas directly, so you can use them without prefix

In [266]:
## Solutions
import numpy as np
import pandas as pd
print(pd.__version__)

from pandas import Series, DataFrame

2.0.0

## Introducing Pandas Objects and Data Indexing and Selection

### Exercises

#### Data Structure: Series

You have 5 customers: Hans, Egon, Ute, Susi and Klaus. In 2010, your revenue in EUR with each of these was 1500, 2500, 3500, 4000 and 2200, respectively. 
- create a pandas Series 'rev' containing this data.
- select all customers with more then 3000 EUR revenue
- Your profit was 33.5% of the revenue. Create a new series 'profit' containing the profit for each customer
- Verify that you have a profit for the customer 'Ute' and that you do NOT have a profit for the customer 'Uwe'

You also have revenue figures for 2011.
- Create another Series 'revc' by first creating a regular Python dict and afterwards converting this to a Series. Here are your revenue figures for the current year: Klaus: 6000, Uwe: 1500, Hans: 1000, Susi: 5000
- furthermore, you know that Anton is also a customer for the current year, but you do not know his revenue. Using your dict from above, create a Series 'revd' containing all known revenues for the current year plus the fact that Anton is a customer without known revenue.
- compute a Series 'revt' containing the total revenues (for the current and the last year) for all customers
- Anton changed his gender, update his/her name to Antonia in the Series 'revt'
- Your sales rep finally sent you Antonias revenue for the current year, it is 10000 EUR. Update 'revt' accordingly.

In [267]:
## Solutions
# 2010
rev = Series([1500, 2500, 3500, 4000, 2200], ["Hans", "Egon", "Ute", "Susi", "Klaus"])
print(rev)
print()
print(rev[rev > 3000])
print()
profit = rev*0.335
print(profit)
print()
try:
    print("Ute:", profit["Ute"])
    print("Use:", profit["Uwe"])
except KeyError as e:
    print("No profit entry for", e)

Hans     1500
Egon     2500
Ute      3500
Susi     4000
Klaus    2200
dtype: int64

Ute     3500
Susi    4000
dtype: int64

Hans      502.5
Egon      837.5
Ute      1172.5
Susi     1340.0
Klaus     737.0
dtype: float64

Ute: 1172.5
No profit entry for 'Uwe'

In [268]:
# 2011
dic = {"Klaus": 6000, "Uwe": 1500, "Hans": 1000, "Susi": 5000}
revc = Series(dic)
dic["Anton"] = None # type: ignore
revd = Series(dic)
print(revd)
print()
revt = Series.add(rev, revd, fill_value=0)
print(revt)
revt["Antonia"] = revd["Anton"]
del revt["Anton"]
revt["Antonia"] = 10000
revt

Klaus    6000.0
Uwe      1500.0
Hans     1000.0
Susi     5000.0
Anton       NaN
dtype: float64

Anton       NaN
Egon     2500.0
Hans     2500.0
Klaus    8200.0
Susi     9000.0
Ute      3500.0
Uwe      1500.0
dtype: float64

Egon        2500.0
Hans        2500.0
Klaus       8200.0
Susi        9000.0
Ute         3500.0
Uwe         1500.0
Antonia    10000.0
dtype: float64

#### Data Structure: DataFrame and Index Objects

- create a DataFrame 'dfrev' containing our revenue data from above, with three columns 'year', 'customer' and 'revenue'. Both the data for 2010 and 2011 shall be included, as well as Antonias revenue. Create the DataFrame by first creating a dict 'rawdata' of equal-length lists and converting this into a DataFrame.
- create another DataFrame 'dfrevp' containing the same data, plus additionally another (empty) column 'profit'. Order the columns as year, customer, revenue, profit. Furthermore, your index values should start at 1000 and increase in steps of 10 (hint: use the range method)
- retrieve all customer names
- retrieve the data for row with index 1010
- retrieve the revenue for row with index 1010
- fill in the profit column (remindet: your profit is 33.5% of revenue)
- add a new column containing the gender auf the customer ('m' or 'f') using a list assigment
- delete the 'profit' column

- create a DataFrame df2 of the revenue where the columns are the years and the rows are the customers by first creating a nested dict and converting this to a DataFrame. Name the columns and rows correctly. 
- create a second table where columns and rows are switched (i.e. columns are the customers and rows the years).
- retrieve the revenue for Hans in 2010 and for Antonia in 2010
- does df2 contain information about the customer 'Ulf'?

In [269]:
## Solutions
dfrev = DataFrame(data=[(2010, c, r) for c, r in rev.items()] + [(2011, c, r) for c, r in revd.items()], columns=["year", "customer", "revenue"])
dfrev.loc[dfrev["customer"] == "Anton", "customer"] = "Antonia"
dfrev.loc[dfrev["customer"] == "Antonia", "revenue"] = 10000
print(dfrev)
dfrevp = dfrev
dfrevp["profit"] = None
dfrevp.set_index(pd.Index(range(1000,1100,10)), inplace=True)
print(dfrevp)

print(dfrevp["customer"])
print(dfrevp.loc[1010])
dfrevp["profit"] = dfrevp["revenue"]*0.335
dfrevp["gender"] = np.where(np.random.random((len(dfrevp,))) > 0.5, "m", "f")
del dfrevp["profit"]
dfrevp

   year customer  revenue
0  2010     Hans   1500.0
1  2010     Egon   2500.0
2  2010      Ute   3500.0
3  2010     Susi   4000.0
4  2010    Klaus   2200.0
5  2011    Klaus   6000.0
6  2011      Uwe   1500.0
7  2011     Hans   1000.0
8  2011     Susi   5000.0
9  2011  Antonia  10000.0
      year customer  revenue profit
1000  2010     Hans   1500.0   None
1010  2010     Egon   2500.0   None
1020  2010      Ute   3500.0   None
1030  2010     Susi   4000.0   None
1040  2010    Klaus   2200.0   None
1050  2011    Klaus   6000.0   None
1060  2011      Uwe   1500.0   None
1070  2011     Hans   1000.0   None
1080  2011     Susi   5000.0   None
1090  2011  Antonia  10000.0   None
1000       Hans
1010       Egon
1020        Ute
1030       Susi
1040      Klaus
1050      Klaus
1060        Uwe
1070       Hans
1080       Susi
1090    Antonia
Name: customer, dtype: object
year          2010
customer      Egon
revenue     2500.0
profit        None
Name: 1010, dtype: object

      year customer  revenue gender
1000  2010     Hans   1500.0      m
1010  2010     Egon   2500.0      f
1020  2010      Ute   3500.0      f
1030  2010     Susi   4000.0      m
1040  2010    Klaus   2200.0      f
1050  2011    Klaus   6000.0      f
1060  2011      Uwe   1500.0      m
1070  2011     Hans   1000.0      f
1080  2011     Susi   5000.0      f
1090  2011  Antonia  10000.0      f

In [270]:
rev_dict = {
    2010:{
        "Hans":1500,
        "Egon":2500,
        "Ute":3500,
        "Susi":4000,
        "Klaus":2200
    },
    2011:{
        "Klaus":6000,
        "Uwe":1500,
        "Hans":1000,
        "Susi":5000,
        "Antonia":10000
    }
}
df2 = DataFrame(rev_dict)
df2 = df2.transpose()
print(df2["Hans"][2010])
print(df2["Antonia"][2010])
try:
    print(df2["Ulf"])
except KeyError as e:
    print("No entry for", e)
df2

1500.0
nan
No entry for 'Ulf'

        Hans    Egon     Ute    Susi   Klaus     Uwe  Antonia
2010  1500.0  2500.0  3500.0  4000.0  2200.0     NaN      NaN
2011  1000.0     NaN     NaN  5000.0  6000.0  1500.0  10000.0

## Operating on Data in Pandas

### Exercises

#### Arithmetic and Data Alignment
You have the revenues numbers for Germany and and France in two DataFrames ger and fra:

In [271]:
ger = DataFrame({
      '2010': {'Hans':1500, 'Egon':2500, 'Ute':3500, 
                'Susi':4000, 'Klaus':2200, 'Uwe':0, 'Antonia':0}, 
      '2011': {'Klaus': 6000, 'Uwe': 1500, 'Hans': 1000, 
               'Susi': 5000, 'Antonia':10000, 'Egon':0, 'Ute':0}})
ger.index.name = 'customer'
ger.columns.name='year'
ger.name = 'Germany'

fra = DataFrame({
      '2010': {'Hans':1100, 'Klaus':200, 'Egon':300, 'Susi':400 , 
               'Jaques': 1100, 'Susanna': 5500, 'Julia':11100}, 
      '2012': {'Klaus': 1000, 'Jaques': 1100, 'Susanna': 5500, 
               'Julia':11100, 'Hans':1100, 'Egon':300, 'Susi':400 , }})
fra.index.name = 'customer'
fra.columns.name='year'
fra.name = 'France'
ger

year      2010   2011
customer
Hans      1500   1000
Egon      2500      0
Ute       3500      0
Susi      4000   5000
Klaus     2200   6000
Uwe          0   1500
Antonia      0  10000

In [272]:
fra

year       2010   2012
customer
Hans       1100   1100
Klaus       200   1000
Egon        300    300
Susi        400    400
Jaques     1100   1100
Susanna    5500   5500
Julia     11100  11100

- compute the total revenues. Do not change the DataFrames ger and fra!

In [273]:
gerfra = ger.add(fra, fill_value=0).fillna(0).astype(int)
gerfra

year       2010   2011   2012
customer
Antonia       0  10000      0
Egon       2800      0    300
Hans       2600   1000   1100
Jaques     1100      0   1100
Julia     11100      0  11100
Klaus      2400   6000   1000
Susanna    5500      0   5500
Susi       4400   5000    400
Ute        3500      0      0
Uwe           0   1500      0

In [274]:
gerfra.sum()

year
2010    33400
2011    23500
2012    20500
dtype: int64

You also have a Series of profit margins you achieved per year:
- compute the absolute profit per customer and year and store the result in a DataFrame 'profit'
- compute a new Series containing the total profit per customer
- compute a DataFrame containing the customers as rows and the  minimum, average and maximum yearly profit per customer as columns
- compute a DataFrame containing the minimum, average and maximum profit per year as rows and the years as columns

In [275]:
## Solutions
margins = Series([0.335, 0.300, 0.310], index=['2010', '2011', '2012'])
profit = gerfra * margins
print(profit)
profit_series = profit.sum(axis=1)
print(profit_series)
profit_stats1 = DataFrame({"min": profit.min(axis=1), "mean": profit.mean(axis=1), "max": profit.max(axis=1)}, index=profit.index)
print(profit_stats1)
profit_stats2 = DataFrame(profit.describe().loc[["min", "mean", "max"]])
print(profit_stats2)

year        2010    2011    2012
customer
Antonia      0.0  3000.0     0.0
Egon       938.0     0.0    93.0
Hans       871.0   300.0   341.0
Jaques     368.5     0.0   341.0
Julia     3718.5     0.0  3441.0
Klaus      804.0  1800.0   310.0
Susanna   1842.5     0.0  1705.0
Susi      1474.0  1500.0   124.0
Ute       1172.5     0.0     0.0
Uwe          0.0   450.0     0.0
customer
Antonia    3000.0
Egon       1031.0
Hans       1512.0
Jaques      709.5
Julia      7159.5
Klaus      2914.0
Susanna    3547.5
Susi       3098.0
Ute        1172.5
Uwe         450.0
dtype: float64
            min         mean     max
customer
Antonia     0.0  1000.000000  3000.0
Egon        0.0   343.666667   938.0
Hans      300.0   504.000000   871.0
Jaques      0.0   236.500000   368.5
Julia       0.0  2386.500000  3718.5
Klaus     310.0   971.333333  1800.0
Susanna     0.0  1182.500000  1842.5
Susi      124.0  1032.666667  1500.0
Ute         0.0   390.833333  1172.5
Uwe         0.0   150.000000   450.0
year    2010    2011    2012
min      0.0     0.0     0.0
mean  1118.9   705.0   635.5
max   3718.5  3000.0  3441.0

## Handling Missing Data

### Exercises

#### Handling and Filling in Missing Data

you just got the revenue figures for Italy:

In [276]:
ger = DataFrame({'2010': {'Hans':1500, 'Egon':2500, 'Ute':3500, 
                'Susi':4000, 'Klaus':2200}, 
      '2011': {'Klaus': 6000, 'Uwe': 1500, 'Hans': 1000, 
               'Susi': 5000, 'Antonia':10000}})
ger.index.name = 'customer'
ger.columns.name='year'
ger.name = 'Germany'

fra = DataFrame({'2010': {'Hans':1100, 'Klaus':200, 'Egon':300, 'Susi':400}, 
      '2012': {'Klaus': 1000, 'Jaques': 1100, 
               'Susanna': 5500, 'Julia':11100}})
fra.index.name = 'customer'
fra.columns.name='year'
fra.name = 'France'

ita = DataFrame({
    '2010': {'Pepe':1500, 'Romano':2500, 'Luigi':3500, 
             'Luigi':4000, 'Maria':2200}, 
    '2011': {'Mario': 6000, 'Maria': 1500, 'Luka': 1000, 
             'Luigi': 5000, 'Eva':10000}, 
    '2012': {'Mario': 3000, 'Romano': 500, 'Maria': 13000, 
             'Eva': 8700, 'Luigi':2900}})
ita.index.name = 'customer'
ita.columns.name='year'
ita.name = 'Italy'
ita

year        2010     2011     2012
customer
Pepe      1500.0      NaN      NaN
Romano    2500.0      NaN    500.0
Luigi     4000.0   5000.0   2900.0
Maria     2200.0   1500.0  13000.0
Mario        NaN   6000.0   3000.0
Luka         NaN   1000.0      NaN
Eva          NaN  10000.0   8700.0

Let's work on the DataFrame for Italy 'ita' first:
- compute a boolean DataFrame where all the cells containing 'Nan' in ita are set to True.
- drop all rows containing at least one NaN. How many rows are left?
- drop all rows and columns containing only NaN. How many rows are left?
- drop all customers with only 1 revenue number
- drop all years containing less than 5 revenue numbers. How many years are being dropped?
- replace all missing revenue numbers in 2010 with 0 and in 2011 and 2012 with -1 and store the result in 'itaclean'.
- actually, you are not quite happy with 'itaclean', the -1 values do not really make sense. A better solution may be to fill in the missing values for year 2010 with 0, and forward-fill the revenue number for 2011 and 2012 from the previous years. Create 'itacleanbetter' based on this idea.

Now, let's bring all three countries together:
- compute the total revenues. Your result must not contain NaN. Do not change the DataFrames ger, fra, ita.

In [277]:
## Solutions
ita_mask = ita.isnull()
ita.dropna()
ita.dropna(how="all")
ita.dropna(how="all", axis=1)
ita.dropna(thresh=len(ita.columns)-1)
ita.dropna(axis=1, thresh=5)
itaclean =  DataFrame(ita["2010"].fillna(0))
itaclean[["2011","2012"]] = ita.loc[:, "2011":"2012"].fillna(-1)
itacleanbetter = ita.copy()
itacleanbetter["2010"].fillna(0, inplace=True)
itacleanbetter.fillna(method="ffill", axis=1)
total = ger.add(fra, fill_value=0).add(ita, fill_value=0).fillna(0)
total

year        2010     2011     2012
customer
Antonia      0.0  10000.0      0.0
Egon      2800.0      0.0      0.0
Eva          0.0  10000.0   8700.0
Hans      2600.0   1000.0      0.0
Jaques       0.0      0.0   1100.0
Julia        0.0      0.0  11100.0
Klaus     2400.0   6000.0   1000.0
Luigi     4000.0   5000.0   2900.0
Luka         0.0   1000.0      0.0
Maria     2200.0   1500.0  13000.0
Mario        0.0   6000.0   3000.0
Pepe      1500.0      0.0      0.0
Romano    2500.0      0.0    500.0
Susanna      0.0      0.0   5500.0
Susi      4400.0   5000.0      0.0
Ute       3500.0      0.0      0.0
Uwe          0.0   1500.0      0.0

## Hierarchical Indexing

### Exercises

- create a DataFrame 'sdw' (with hierarchical indexes, containing int numbers) where the columns  three countries ger (with customers Ute and Uwe), fra (with customer George) and ita (with customers Maria, Luigi and Mario).  The rows show the years 2010 and 2011 each with four quarters. The cells show the revenue for each Customer/Quarter (i.e. a total of 48 numbers, generate them randomly). 
- select all data for Italy from sdw
- select the data for 2011 from sdw
- name your indexes 'year', 'quarter', 'country' and 'customer'
- swap 'year' with 'quarter' and sort the result by 'quarter' (hint: the `swaplevel` method of the DataFrame may be helpful)
- compute the revenue per year for each customer (i.e. sum the quarter)
- compute the revenue per country for each quarter (i.e. sum the customers)
- compute the revenue per year and per country (i.e. combine both sums from the two previous problems)

In [339]:
## Solutions
sdw = DataFrame(data=np.random.default_rng().integers(0,10000,size=(8,6)),
                index=pd.MultiIndex.from_product([["2010", "2011"], ["Q1", "Q2", "Q3", "Q4"]]),
                columns=[2*["ger"]+1*["fra"]+3*["ita"], ["Ute", "Uwe", "George", "Maria", "Luigi", "Mario"]])
sdw["ita"]
sdw.loc["2011",:]
sdw.index.names = ["year", "quarter"]
sdw.columns.names = ["country", "customer"]
sdw = sdw.swaplevel("year","quarter").sort_index()
sdw.groupby("year").sum()
sdw.groupby("country", axis=1).sum()
sdw.groupby("year").sum().groupby("country", axis=1).sum()

country    fra    ger    ita
year
2010     15045  39745  60008
2011     22099  47092  60251